edwios/nRF5_WS2812B/main.c
    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
//    err_code = ble_advdata_set(&advdata, &scanrsp);   // works equally well
    m_is_advertising = false;

    char str[255];
    sprintf(str, "Error code: %lu\n", err_code);
    SEGGER_RTT_WriteString(0, str);
    APP_ERROR_CHECK(err_code);
    SEGGER_RTT_WriteString(0, "advertising_init: done\n");
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    SEGGER_RTT_WriteString(0, "DEBUG: BLE GAP Params init\n");
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    SEGGER_RTT_WriteString(0, "DEBUG: BLE Connection Params init\n");
    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Peer Manager initialization.
 *
 * @param[in] erase_bonds  Indicates whether bonding information should be cleared from
 *                         persistent storage during initialization of the Peer Manager.
 */
static void peer_manager_init(bool erase_bonds)
{
    ble_gap_sec_params_t sec_param;
    ret_code_t           err_code;

    SEGGER_RTT_WriteString(0, "DEBUG: Peer Manager init\n");
    err_code = pm_init();
    APP_ERROR_CHECK(err_code);

    if (erase_bonds)
    {
        err_code = pm_peers_delete();
        APP_ERROR_CHECK(err_code);
    }

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = fds_register(fds_evt_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    /* ### */
    SEGGER_RTT_WriteString(0, "DEBUG: Services init\n");
    our_service_init(&m_our_service, &m_uuid_type);    

}

/** Various timer start/stop functions
 */

 /**@brief Function for starting application timers.
 */
static void application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_app_char_timer_id, UVINDEX_LEVEL_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

static void  adv_led_timer_start(void)
{
    uint32_t err_code;

    err_code = app_timer_start(m_app_adv_timer_id, ADV_LED_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for Stopping application timers.
 */
static void application_timers_stop(void)
{
    uint32_t err_code;

    err_code = app_timer_stop(m_app_char_timer_id);
    LEDS_OFF(LEDBUTTON_LED_PIN);
    APP_ERROR_CHECK(err_code);
}

static void  adv_led_timer_stop(void)
{
    uint32_t err_code;

    err_code = app_timer_stop(m_app_adv_timer_id);
    APP_ERROR_CHECK(err_code);
}

/** Application program functions start/stop
 */


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t             err_code;
    ble_gap_adv_params_t adv_params;

    // Start advertising
    memset(&adv_params, 0, sizeof(adv_params));

    adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
    adv_params.p_peer_addr = NULL;
    adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    adv_params.interval    = APP_ADV_INTERVAL;
    adv_params.timeout     = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = sd_ble_gap_adv_start(&adv_params);
    APP_ERROR_CHECK(err_code);
    adv_led_timer_start();
    m_is_advertising = true;
//    LEDS_ON(ADVERTISING_LED_PIN);
}

/** Perform rainbow
 */

static void do_rainbow(void)
{
    rgb_led_t led_array[NUM_LEDS];
    uint32_t current_limit;

    SEGGER_RTT_WriteString(0,"Demo start\n");
    LEDS_INVERT(GOODLED);
    
    rainbow_init(NUM_LEDS);
    
    int32_t time_left = DEMO_PERIOD;
    int32_t step_time = CYCLE_TIME;
    while (time_left > 0 )
    {
        LEDS_INVERT(GOODLED);   // Beat the heart

        // work out the LED colors for each cycle 
        rainbow(led_array);

        // Adjust total current used by LEDs to below the max allowed 
        current_limit = MAX_TOTAL_CURRENT;
        ws2812b_drive_current_cap(led_array, NUM_LEDS, current_limit);

        if (i2s_ws2812b_drive_xfer(led_array, NUM_LEDS, STDOUT) != NRF_SUCCESS) {
            LEDS_ON(BADLED);    // Lit error indicator up
            SEGGER_RTT_WriteString(0,"ERROR: Send to LED failed!\n");
        } else {
            LEDS_OFF(BADLED);   // Reset bad status indicator
        }

        nrf_delay_ms(CYCLE_TIME);

        time_left -= step_time;
    }

