edwios/nRF5_WS2812B/main.c
    rainbow_uninit();
    
    // Turn off LEDs
    ws2812b_drive_set_blank(led_array,NUM_LEDS);
    i2s_ws2812b_drive_xfer(led_array, NUM_LEDS, STDOUT);
    // Wait 3s before restart the rainbow
    SEGGER_RTT_WriteString(0,"Blank LED and Wait 3s\n");
    LEDS_ON(BLANKLED);
    nrf_delay_ms(3000);
    LEDS_OFF(BLANKLED);
}

static void change_color(void)
{
    char sv[64];

    rgb_led_t led_array[NUM_LEDS];
    uint32_t current_limit;

    SEGGER_RTT_WriteString(0,"DEBUG: Change Color\n");
    rainbow_init(NUM_LEDS);
    // work out the LED colors for each cycle 
    setcolor(led_array, m_rgb_color);

    sprintf(sv, "Change Color: %lx\n", m_rgb_color);
    SEGGER_RTT_WriteString(0, sv); 

    // Adjust total current used by LEDs to below the max allowed 
    current_limit = MAX_TOTAL_CURRENT;
    ws2812b_drive_current_cap(led_array, NUM_LEDS, current_limit);
    SEGGER_RTT_WriteString(0, "current cap\n"); 

    if (i2s_ws2812b_drive_xfer(led_array, NUM_LEDS, STDOUT) != NRF_SUCCESS) {
        SEGGER_RTT_WriteString(0,"ERROR: Send to LED failed!\n");
    } else {
        SEGGER_RTT_WriteString(0, "OK send LED\n"); 
    }

    rainbow_uninit();
    SEGGER_RTT_WriteString(0,"DEBUG: Sent to LED!\n");
}

/**@brief Function for the Power Manager.
 */

static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}


/****************
 *   Main()
 ****************/

int main(void)
{
    ret_code_t err_code;

//	LEDS_CONFIGURE(GOODLED | BLANKLED | BADLED);
//	LEDS_OFF(GOODLED | BLANKLED| BADLED);
	SEGGER_RTT_WriteString(0, "WS2812b Demo\n");

    // Initialize.
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
    leds_init();
    timers_init();
    buttons_init();

    ble_stack_init();
    peer_manager_init(false);
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    SEGGER_RTT_WriteString(0, "INFO: BLE inited\n");

    advertising_start();

    do_rainbow();

	while (1)	// repeat forever
    {
        if (m_color_changed) {
            m_color_changed = false;
            change_color();
        }
/*        NRF_LOG_FLUSH();
        if (NRF_LOG_PROCESS() == false)
        {
                power_manage();
        }
        */
	}
   
}


/** @} */
